app/views/lessons/index.html.erb

<br>
<h3>Lessons for course: <%=@lessons.first.objective.course.name%></h3><br>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]