app/views/courses/_form.html.erb

SELECT "learner_styles".* FROM "learner_styles"
---
        <div class="col-sm-10">
          <%=f.select :learner_style_id, LearnerStyle.all.collect { |ls| [ls.name, ls.id] },{},class:"form-control"%>