app/controllers/dashboard_controller.rb

	def student_home
  	### check if profile learner id is set for the user
  	#if set dont show questions show the courses
  	## else show questions
  	@show_questions_flag = true
  	profile = Porfile.where(user_id:current_user.id).first
  	if profile.present?
  		if profile.learner_dimension_scale_id.present?
  			### show courses here
  			@show_questions_flag = false
        @courses = Course.where(learner_style_id:profile.learner_dimension_scale.learner_style.id)
  		else
  			@questions = Question.all
---
SELECT  "porfiles".* FROM "porfiles" WHERE "porfiles"."user_id" = $1 ORDER BY "porfiles"."id" ASC LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "learner_dimension_scales".* FROM "learner_dimension_scales" WHERE "learner_dimension_scales"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."learner_style_id" = $1  [["learner_style_id", 3]]
SELECT "questions".* FROM "questions"

  def edit_profile
  	@profile = Porfile.find_or_create_by(user_id:current_user.id)
---
INSERT INTO "porfiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 6], ["created_at", 2017-02-11 07:18:50 UTC], ["updated_at", 2017-02-11 07:18:50 UTC]]
SELECT  "porfiles".* FROM "porfiles" WHERE "porfiles"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]

  def save_profile
  	profile_params = save_profile_params
  	if profile_params[:user_id].present?
  		profile = Porfile.where(user_id:profile_params[:user_id]).first
  		profile.update_attributes(first_name:profile_params[:first_name],
  			last_name:profile_params[:last_name])
---
SELECT  "porfiles".* FROM "porfiles" WHERE "porfiles"."user_id" = $1 ORDER BY "porfiles"."id" ASC LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
UPDATE "porfiles" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "porfiles"."id" = $4  [["first_name", "test111"], ["last_name", "test3233"], ["updated_at", 2017-02-11 07:24:03 UTC], ["id", 3]]