app/controllers/instructor_controller.rb

SELECT "porfiles".* FROM "porfiles" WHERE ("porfiles"."learner_dimension_scale_id" IS NOT NULL)
---
  def learners
    @profiles = Porfile.where.not(learner_dimension_scale_id:nil)