app/controllers/learner_styles_controller.rb

SELECT "learner_styles".* FROM "learner_styles"
---
  def index
    @learner_styles = LearnerStyle.all

SELECT  "learner_styles".* FROM "learner_styles" WHERE "learner_styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_learner_style
      @learner_style = LearnerStyle.find(params[:id])