app/controllers/learner_dimension_scales_controller.rb

  def index
    @learner_dimension_scales = LearnerDimensionScale.all
---
SELECT "learner_dimension_scales".* FROM "learner_dimension_scales"

    def set_learner_dimension_scale
      @learner_dimension_scale = LearnerDimensionScale.find(params[:id])
---
SELECT  "learner_dimension_scales".* FROM "learner_dimension_scales" WHERE "learner_dimension_scales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]