app/controllers/lessons_controller.rb

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."objective_id" = $1 ORDER BY "lessons"."id" ASC LIMIT $2  [["objective_id", 1], ["LIMIT", 1]]
---
  def index
    @lessons = Lesson.where(objective_id:params[:objective_id])

SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @lesson = Lesson.new
    @objective = Objective.find(params[:objective_id])

INSERT INTO "lessons" ("name", "objective_id", "content_file_name", "content_content_type", "content_file_size", "content_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save

UPDATE "lessons" SET "content_file_name" = $1, "content_content_type" = $2, "content_file_size" = $3, "content_updated_at" = $4, "updated_at" = $5 WHERE "lessons"."id" = $6
---
  def update
    respond_to do |format|
      if @lesson.update(lesson_params)

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_lesson
      @lesson = Lesson.find(params[:id])
      @objective = Objective.find(params[:objective_id])