app/controllers/objectives_controller.rb

SELECT "objectives".* FROM "objectives"
---
  def index
    @objectives = Objective.all

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def new
    @objective = Objective.new
    @current_course = Course.find(params[:id])

INSERT INTO "objectives" ("name", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test2222"], ["course_id", 2], ["created_at", 2017-02-14 08:43:43 UTC], ["updated_at", 2017-02-14 08:43:43 UTC]]
---
  def create
    @objective = Objective.new(objective_params)

    respond_to do |format|
      if @objective.save

SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_objective
      @objective = Objective.find(params[:id])