app/models/user.rb

  def set_default_role
    self.role ||= Role.find_by_name('student')
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2